## OpenTofu Plan: governance

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_consumption_budget_subscription.cheapo["connectivity_nonprod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["connectivity_prod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["devops_nonprod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["devops_prod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["edge_nonprod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["edge_prod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["esb_nonprod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["esb_prod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["iam_nonprod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["iam_prod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["identity"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["management"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["observability_nonprod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["observability_prod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["payment_nonprod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["payment_prod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["security_nonprod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

  # azurerm_consumption_budget_subscription.cheapo["security_prod"] will be created
  + resource "azurerm_consumption_budget_subscription" "cheapo" {
      + amount          = 1
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "cheapo"
      + subscription_id = (sensitive value)
      + time_grain      = "Monthly"

      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 100
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 25
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = []
          + contact_groups = []
          + contact_roles  = [
              + "Owner",
            ]
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 75
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = (known after apply)
          + start_date = "2026-01-01T00:00:00Z"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.
```
